# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'homebrew/php'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

# Install more recent versions of some macOS tools
brew 'homebrew/dupes/grep'

# Install Binaries
brew 'awscli'
brew 'git'
brew 'hub'
brew 'mackup'
brew 'mas'
brew 'node'
brew 'trash'
brew 'tree'
brew 'wget'
brew 'yarn'

# Development
brew 'mysql'
brew 'python'
brew 'php'
brew 'go'

# Apps
cask '1password'
cask 'android-studio'
cask 'android-file-transfer'
cask 'alfred'
cask 'bloomrpc'
cask 'cloudapp'
cask 'charles'
cask 'db-browser-for-sqlite'
cask 'docker'
cask 'firefox'
cask 'flux'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'google-chrome-canary'
cask 'graphql-playground'
cask 'gpg-suite'
cask 'hyper'
cask 'iterm2'
cask 'java'
cask 'logitech-options'
cask 'microsoft-office'
cask 'notion'
cask 'ngrok'
cask 'postman'
cask 'pritunl'
cask 'spotify'
cask 'slack'
cask 'tor-browser'
cask 'visual-studio-code'
cask 'vlc'
cask 'vivaldi'
cask 'zoomus'

# Fonts
cask 'font-fira-code'
cask 'font-inconsolata-for-powerline'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-cascadia'
cask 'font-iosevka'

# Install Mac App Store apps
mas 'Xcode', id: 497799835
mas 'Magnet', id: 441258766 
mas 'CopyClip 2 - Clipboard Manager', id: 1020812363
